# ============================================================================
# Brewfile - Modern Agent-Focused Development Environment
# ============================================================================

# Taps (note: homebrew/bundle and homebrew/services are now built-in)

# ============================================================================
# Core CLI Tools
# ============================================================================
brew "chezmoi"           # Dotfile manager
brew "git"               # Version control
brew "gh"                # GitHub CLI
brew "git-lfs"           # Git Large File Storage

# Shell
brew "zsh"               # Shell
brew "starship"          # Prompt
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Modern CLI replacements
brew "bat"               # Better cat
brew "eza"               # Better ls (successor to exa)
brew "fd"                # Better find
brew "ripgrep"           # Better grep
brew "fzf"               # Fuzzy finder
brew "zoxide"            # Smarter cd
brew "jq"                # JSON processor
brew "yq"                # YAML processor

# Development
brew "mise"              # Version manager (Ruby, Node, Python, etc.)
brew "direnv"            # Per-directory environment

# Utilities
brew "curl"
brew "wget"
brew "htop"
brew "tree"
brew "tldr"              # Simplified man pages
brew "mas"               # Mac App Store CLI
brew "fortune"           # Random quotes on terminal start
brew "mackup"            # App settings backup/restore
brew "terminal-notifier" # macOS notifications from CLI

# Process Management
brew "overmind"          # Procfile-based process manager (tmux-based)

# Development Libraries
brew "libpq"             # PostgreSQL C client library
brew "libsodium"         # Crypto library (used by Rails, etc.)
brew "libyaml"           # YAML parser (required by Ruby)
brew "vips"              # Fast image processing
brew "glib"              # Core C library (dependency for many tools)

# ============================================================================
# 1Password
# ============================================================================
cask "1password"
cask "1password-cli"

# ============================================================================
# Agent / AI Tools
# ============================================================================
cask "codex"             # AI coding assistant
cask "codex-app"         # Codex desktop app
cask "claude"            # Claude AI chat assistant
cask "claude-code"       # Claude AI coding assistant
cask "lm-studio"         # Local LLM runner

# ============================================================================
# Development Apps
# ============================================================================
cask "zed"               # Text editor
cask "cursor"            # AI-powered editor
cask "warp"              # AI-powered terminal
cask "docker-desktop"    # Containers
cask "jetbrains-toolbox" # JetBrains IDE manager
cask "ngrok"             # Secure tunnels to localhost
cask "rapidapi"          # API testing (Paw)
cask "transmit"          # FTP/SFTP client

# ============================================================================
# Browsers
# ============================================================================
cask "google-chrome"
cask "orion"             # WebKit browser

# ============================================================================
# Productivity
# ============================================================================
cask "alfred"            # Launcher
cask "shottr"            # Screenshots
cask "dash"              # Documentation browser
cask "suspicious-package" # macOS .pkg inspector

# ============================================================================
# Fonts (Nerd Fonts for Starship icons)
# ============================================================================
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-source-code-pro-for-powerline"

# ============================================================================
# Mac App Store
# ============================================================================
mas "1Password for Safari", id: 1569813296
mas "Kagi for Safari", id: 1622835804
mas "WireGuard", id: 1451685025
