# ============================================================================
# Brewfile - Modern Agent-Focused Development Environment
# ============================================================================

# Taps (note: homebrew/bundle and homebrew/services are now built-in)

# ============================================================================
# Core CLI Tools
# ============================================================================
brew "chezmoi"           # Dotfile manager
brew "git"               # Version control
brew "gh"                # GitHub CLI
brew "git-lfs"           # Git Large File Storage

# Shell
brew "zsh"               # Shell
brew "starship"          # Prompt
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Modern CLI replacements
brew "bat"               # Better cat
brew "eza"               # Better ls (successor to exa)
brew "fd"                # Better find
brew "ripgrep"           # Better grep
brew "fzf"               # Fuzzy finder
brew "zoxide"            # Smarter cd
brew "jq"                # JSON processor
brew "yq"                # YAML processor

# Development
brew "mise"              # Version manager (Ruby, Node, Python, etc.)
brew "direnv"            # Per-directory environment

# Utilities
brew "curl"
brew "wget"
brew "htop"
brew "tree"
brew "tldr"              # Simplified man pages
brew "mas"               # Mac App Store CLI

# ============================================================================
# 1Password
# ============================================================================
cask "1password"
cask "1password-cli"

# ============================================================================
# Agent / AI Tools
# ============================================================================
cask "codex"             # AI coding assistant

# ============================================================================
# Development Apps
# ============================================================================
cask "cursor"            # AI-powered editor
cask "warp"              # AI-powered terminal
cask "docker"            # Containers

# ============================================================================
# Browsers
# ============================================================================
cask "google-chrome"
cask "orion"             # WebKit browser

# ============================================================================
# Productivity
# ============================================================================
cask "alfred"            # Launcher
cask "shottr"            # Screenshots
cask "dash"              # Documentation browser

# ============================================================================
# Fonts (Nerd Fonts for Starship icons)
# ============================================================================
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"

# ============================================================================
# Mac App Store
# ============================================================================
mas "1Password for Safari", id: 1569813296
mas "Kagi for Safari", id: 1622835804
